/* 
* @Author: anchen
* @Date:   2019-08-23 19:54:00
* @Last Modified by:   anchen
* @Last Modified time: 2019-08-24 12:00:40
*/

'use strict';
var lyric={
    ycjh:function(){
        var text1=document.getElementById('text1');
        text1.innerHTML='[00:00.00]杨宗纬 - 一次就好[00:02.00]电影《夏洛特烦恼》暖水曲[00:05.00]作词：陈曦[00:08.00]作曲：董冬冬[00:25.54]想看你笑[00:28.39]想和你闹[00:30.45]想拥你入我怀抱[00:36.26]上一秒红着脸在争吵[00:41.68]下一秒转身就能和好[00:48.25]不怕你哭[00:51.14]不怕你叫[00:53.01]因为你是我的骄傲[00:58.91]一双眼睛追着你乱跑[01:04.41]一颗心早已经准备好[01:15.97]一次就好我带你去看天荒地老[01:21.62]在阳光灿烂的日子里开怀大笑[01:27.25]在自由自在的空气里吵吵闹闹[01:32.43]你可知道我唯一的想要[01:38.36]世界还小我陪你去到天涯海角[01:44.13]在没有烦恼的角落里停止寻找[01:49.84]在无忧无虑的时光里慢慢变老[01:55.09]你可知道我全部的心跳[02:00.59]随你跳[02:24.13]想看你笑[02:26.76]想和你闹[02:28.98]想拥你入我怀抱[02:34.64]上一秒红着脸在争吵[02:40.25]下一秒转身就能和好[02:46.88]不怕你哭[02:49.68]不怕你叫[02:51.54]因为你是我的骄傲[02:57.52]一双眼睛追着你乱跑[03:02.84]一颗心早已经准备好[03:14.45]一次就好我带你去看天荒地老[03:20.18]在阳光灿烂的日子里开怀大笑[03:25.88]在自由自在的空气里吵吵闹闹[03:31.38]你可知道我唯一的想要[03:36.88]世界还小我陪你去到天涯海角[03:42.78]在没有烦恼的角落里停止寻找[03:48.48]在无忧无虑的时光里慢慢变老[03:57.46]你可知道我全部的心跳[04:04.45]随你跳';
        l=9;
        lw=7;
    },
    xChou:function(){
        var text1=document.getElementById('text1');
        text1.innerHTML='[00:00.00]毛不易 - 消愁[00:02.00]明日之子 第七期[00:04.00]词：毛不易[00:05.00]曲：毛不易[00:06.00]编曲：郑楠[00:07.00]音乐总监：谭伊哲[00:08.00]乐队：TYZ乐队[00:17.60]当你走进这欢乐场[00:21.58]背上所有的梦与想[00:26.01]各色的脸上各色的妆[00:30.23]没人记得你的模样[00:34.69]三巡酒过你在角落[00:39.11]固执的唱着苦涩的歌[00:43.37]听他在喧嚣里被淹没[00:47.61]你拿起酒杯对自己说[00:52.19]一杯敬朝阳 一杯敬月光[00:56.50]唤醒我的向往 温柔了寒窗[01:00.61]于是可以不回头地逆风飞翔[01:05.23]不怕心头有雨 眼底有霜[01:09.96]一杯敬故乡 一杯敬远方[01:14.10]守着我的善良 催着我成长[01:18.07]所以南北的路从此不再漫长[01:22.67]灵魂不再无处安放[01:47.12]一杯敬明天 一杯敬过往[01:51.25]支撑我的身体 厚重了肩膀[01:55.16]虽然从不相信所谓山高水长[01:59.88]人生苦短何必念念不忘[02:04.23]一杯敬自由 一杯敬死亡[02:08.55]宽恕我的平凡 驱散了迷惘[02:12.65]好吧天亮之后总是潦草离场[02:17.58]清醒的人最荒唐[02:21.11]好吧天亮之后总是潦草离场[02:25.83]清醒的人最荒唐';
        l=10;
        lw=8;
    },
    xpz:function(){
        var text1=document.getElementById('text1');
        text1.innerHTML='[00:00.00]小瓶子 - 林俊杰[00:07.54]作词：林俊杰/林怡凤[00:09.56]作曲：林俊杰[00:11.58]编曲：政勋/田雅欣[00:23.67]手握着小瓶子 装平凡的日子[00:29.83]生活的大小事 熟悉的过客[00:35.82]倒影中看彼此 各种喜怒哀乐[00:41.82]紧扣着手指 最初的掩饰[00:47.85]漂向远方的影子[00:56.57]纷纷折迭的沉默 层层隐藏另一个我[01:08.34]说着不完美的音色 穿过一朵朵绚烂的漩涡[01:20.22]匆匆风吹花开日落 时间啊解开我的迷惑[01:31.26]许下的愿望 在天边海角铺成了银河[01:38.28]等着流浪的你来牵住我的手[02:19.94]漂流的小瓶子 装哭笑的样子[02:26.07]疯狂或是幼稚 忧伤或天真[02:32.02]思念也会带刺 也会透出光泽[02:38.10]紧扣的手指 眼里的诚实[02:44.12]倒映彼此的影子[02:49.88]最后的割舍 锁进了盒子[02:56.22]写下新的故事[03:04.74]纷纷折迭的沉默 层层隐藏另一个我[03:16.76]说着不完美的音色 穿过一朵朵绚烂的漩涡[03:28.73]匆匆风吹花开日落 时间啊解开我的迷惑[03:39.61]许下的愿望 在天边海角铺成了银河[03:46.78]等着流浪的你紧紧牵住我的手';
        l=7;
        lw=9;
    },
    beyond:function(){
        var text1=document.getElementById('text1');
        text1.innerHTML='[00:00.31]海阔天空-Beyond[00:18.51]今天我寒夜里看雪飘过[00:25.16]怀着冷却了的心窝飘远方[00:30.92]风雨里追赶[00:33.74]雾里分不清影踪[00:36.66]天空海阔你与我[00:39.94]可会变(谁没在变)[00:43.61]多少次迎着冷眼与嘲笑[00:49.87]从没有放弃过心中的理想[00:55.71]一刹那恍惚[00:58.85]若有所失的感觉[01:01.64]不知不觉已变淡[01:05.00]心里爱(谁明白我)[01:08.75]原谅我这一生不羁放纵爱自由[01:15.91]也会怕有一天会跌倒 哦NO[01:21.81]背弃了理想谁人都可以[01:28.04]哪会怕有一天只你共我[01:42.76]今天我寒夜里看雪飘过[01:49.18]怀着冷却了的心窝飘远方[01:54.89]风雨里追赶[01:57.96]雾里分不清影踪[02:01.47]天空海阔你与我可会变[02:05.37](谁没在变)[02:07.96]原谅我这一生不羁放纵爱自由[02:15.11]也会怕有一天会跌倒 哦NO[02:21.08]背弃了理想谁人都可以[02:27.57]哪会怕有一天只你共我[02:32.28]哦 yeah[03:08.63]仍然自由自我[03:11.75]永远高唱我歌[03:14.76]走遍千里[03:19.62]原谅我这一生不羁放纵爱自由[03:26.51]也会怕有一天会跌倒[03:31.04]哦NO[03:32.78]背弃了理想谁人都可以[03:39.18]哪会怕有一天只你共我[03:45.57]被弃了理想谁人都可以[03:51.73]哪会怕有一天只你共我[03:56.29]哦yeah[03:57.35]原谅我这一生不羁放纵爱自由[04:02.57]哦yeah[04:04.25]也会怕有一天会跌倒哦[04:10.18]背弃了理想谁人都可以[04:16.64]哪会怕有一天只你共我';
        l=8;
        lw=0;
    },
}